---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyEnum
source: html/4d9ba34e-b330-523b-a5fc-2ccd593f3f6f.htm
---
# AssetPropertyEnum Methods

Adds a new connected asset attached to this asset property, if it allows it.